Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F13B.tmx
Source language: en_us
Languages: zh_cn

source: being rich
zh_cn: 美满生活

source: We prowled through the second hand bookstore, the day after Christmas, just my husband, Louie, our daughters, Jenny and Helen, and me.
zh_cn: 我们就这样，在圣诞节之后在这件二手书屋里徜徉着。我们人不多，就只有我丈夫刘易斯，一双女儿，珍妮还有爱伦，还有我。

source: This was a precious time for us, because we would be splitting up as a family, again, in just a couple of days.
zh_cn: 对于我们来说，这是一个美好的时刻，因为我们在这么一两天时间里，又重新聚合在一起了！

source: It had been a tough eight months since my husband had retired from the Navy.
zh_cn: 打从我丈夫从海军退役后，我们这八个月的生活可以说是坚强了很多。

source: As plotters and planners, we had manipulated the "military system," while on active duty, as much as we could, trying to prevent a long, dreaded absence from one another.
zh_cn: 作为我们生活中的规划者和领导者，我们习惯了丈夫为我们制定的“军规铁纪”，并在生活中尽我们最大的努力履行它，在长达八个月的时间里互相监督，互相促进。

source: Now, here we were, retired, and we were eight months into our longest separation.
zh_cn: 现在呢，看看我们吧，我们都已经合格了，可以说是经过八个月的纪律整顿，我们已完全融入到生活中去了。

source: When my husband retired, we discovered that the only job available for him was in the city of Norfolk, Virginia.
zh_cn: 我丈夫退役时，我们发现适合他这一行的工作只能在弗吉尼亚州的诺尔佛尔克市找得到。

source: Our dream was to live out the rest of our lives in the mountains of southwestern Virginia, six and a half hours away.
zh_cn: 可我们却希望在弗吉尼亚州的西南方的大山（阿巴拉契亚山脉）找一个立足点，那地方离这只有六个半小时的车程。

source: My health had gotten so bad, that it was impossible for me to stay with Louie in the city.
zh_cn: 但我的健康不尽人意，因此不可能长久的和刘易斯呆在诺尔佛尔克。

source: We had settled for a separation, praying that a job would become available in the beautiful region that we love.
zh_cn: 我们只能分居两地，并希望在我们的城市能找到一份尽心的工作。

source: So, there we were, delaying the inevitable, passing time in a second hand bookstore, before the girls and I headed back to southwest Virginia.
zh_cn: 因此，在这儿，在我和一双女儿回到弗吉尼亚州前，我们只能在一间二手书店里过着一种闲散安逸的生活，以此打发时间。

source: We were as broke as we'd ever been, supporting two households; yet we were grateful to be together, and we seized every opportunity for extra hugs, shared daydreams and laughter.
zh_cn: 我们只能这样，自顾自地安顿两座房子。但我们还是很感激，一家人又在一起了，怎么说，我们把这看成是上天眷顾吧！在一起时，我们母女三人总能充满欢声笑语，还有浮想联翩。

source: There was only one other person in the bookstore, besides the proprietor, a lovely, well-dressed, woman, about my age.
zh_cn: 在这间小小的书屋里，在书屋经理旁边，还有一位和我年纪相仿的妇人，她着装得体，很有淑女气质。

source: I noticed her clothes, her shoes, and her expensive handbag, and I wondered what it would be like, to be rich enough to walk into a bookstore and have the money to buy any book my heart desired.
zh_cn: 我注视了一下她的衣服。鞋子，还有很贵重的手包，我心里就有了这样一种感觉：我一定很有钱吧，要不然怎么会到这间书屋里买自己心仪的书啊？

source: But we were having so much fun, that I quickly forgot the woman.
zh_cn: 但我们还有比这更为快乐的事，所以，很快，我便把这位妇人落在一旁了。

source: We joked as we continued our treasure hunt, clutching our spending money of five dollars apiece, all hoping to be the first to find the oldest, least expensive book.
zh_cn: 接着，我们便在欢笑中继续我们的“寻宝行动”，因为我们只带了五美元，因而只能对每一美元精打细算，以期找到书架上那本最古旧，价钱最少的书。

source: It was a bittersweet excursion.
zh_cn: 这可是一次甜蜜的旅行啊（译者注：涉猎群书，在精神上也是一笔丰厚的财富）！

source: Frequently Louie and I would brush past one another, finding excuses to touch or to give on another's hand an extra squeeze.
zh_cn: 通常来说，我们夫妇俩总是在一本又一本的书上拂来拂去，寻找一种书本经由他人之手后，又在我这里发现其价值的感觉。

source: Jenny remembered, that there was an ATM machine, not far from the bookstore, and she decided that she needed another twenty dollars that she had squirreled away.
zh_cn: 珍妮记性很不错，她记得这附近有一个自动取款机，就在书屋不远处。她还想要20美元,连同这五美元一起拿去买书。

source: "No fair!" I cried, laughing. "The rest of us can only spend five dollars, and here you're going to have twenty-five dollars?!"
zh_cn: “怎么可能？我们只带了五美元，你要用什么办法变出25美元啊！？”我忍不住笑出来了，尖叫道。

source: We all laughed, and we began to tease Jenny, mercilessly, but she was able to convince her Dad that she must have the $20, in order to get that irresistible book.
zh_cn: 我们都笑了，开始奚落小珍妮。她很无助，就去向爸爸找安慰，她想爸爸应该还有20美元吧，这样就能买那本她心仪已久的故事集。

source: "Come on, Jenny," Louie laughed. "I'll drive you to the ATM."
zh_cn: “好吧，亲爱的珍妮，我带你去取钱。”刘易斯笑着说。

source: Then we did another round of hugging and kissing, none of us wanting to be apart for even a few minutes.
zh_cn: 之后我们就亲了又亲，抱了又抱，分开了。

source: Soon Louie and I would be saying "good-bye."
zh_cn: 很快，又到了分别时刻。

source: We couldn't resist the opportunity to assure one another of our love, and our faith that our separation would soon come to an end.
zh_cn: 说真的，我不希望我俩分别，可没办法，我俩的爱情，还有共同的信仰在某些时刻总得中止一段时间。

source: It must have been a curious ballet, this demonstrative family scene, but we were oblivious to what others might think.
zh_cn: 这是一个难分难舍的时刻，可对于军人家庭来说，这又是一道再正常不过的风景，可实际上，我们的内心也是和普通家庭的离别一样的。

source: Military families seem to fall into two categories: those who look for affectionate opportunities, and those who avoid close contact, because "good-byes" are painful.
zh_cn: 对于军人家庭来说，在某个时期，总得上演两出戏剧：在为国家履行使命时，一语不发就走了，因为对他们来说，“再见”这个词是一个隐晦的词。

source: I have to admit that we're a pretty "huggy-kissy" family, so unmindful of anyone else, we continued to give kisses and hugs all around.
zh_cn: 我别无选择，只能用吻别来作为我们的离别礼，尽管这很痛苦，但我们还是这样做了。

source: In our military career, we had become painfully aware, that anything can happen during even the briefest separation.
zh_cn: 在丈夫出征作战的时间里，我们双方都很痛苦，因为我们双方都要忍受一段时间在别人眼里看来是最高尚的分离。

source: But now, as I look back, I realize how odd me must have looked.
zh_cn: 可现在呢，回想这些想法，我还觉得自己很幼稚。

source: Finally, in between another hug and kiss, I saw the perfect book for me! It was one hundred years old, and it was on my favorite time period, the Middle Ages.
zh_cn: 末了，在互相吻别时刻，我惊喜地收到一本书，有一百多年了，还是我最喜欢的关于中世纪的书！

source: Oh, how I wanted that book!
zh_cn: 啊！我终于得到我梦寐以求的书了。

source: I quickly checked the inside cover for the price, and my heart fell. It was twenty-five dollars!
zh_cn: 我看了一下书价，25美元啊！

source: We just didn't have it. I looked up at Louie, already knowing the answer.
zh_cn: 我们就缺这本书了，我看了一下他的眼睛，明亮而又闪烁，答案就在这里了！

source: He must have wanted me to have that book. I could see the pain in his eyes.
zh_cn: 他早知道我想要这本书了，我看看他充满体贴的眼睛就知道了。

source: Louie reached out and gave me an extra hug.
zh_cn: 之后，他就给了我一个热烈的拥抱。

source: I understood his "honey, we just can't afford it" message.
zh_cn: 我知道了，为什么他说“亲爱的，不是我不买。而是我支付不起”的意思了。

source: I leaned into his sheltering arms, and I saw that the well-dressed lady was also touching the book that I wanted.
zh_cn: 我依偎在他坚强的臂膀里，我还记得那位妇人还在翻看我想要的那本书。

source: Ah well, let her have it.
zh_cn: 好了，他要就给她吧。

source: I gave Louie and extra hug, and half serious, I murmured, as my eyes locked with hers.
zh_cn: 我紧紧地抱着刘易斯，很是惊喜，闭上双眼，还在想那位妇人。

source: "Oooohh, I wish I were rich!"
zh_cn: “嗷！上帝啊！我真幸福！”

source: "It looks to me, as though you already are," she said with a smile.
zh_cn: “我也是的，看到你俩这样，我也不由得幸福了起来。”这位妇人微笑着说。

source: There was a pause that stretched through eternity, and my heart filled with comprehension.
zh_cn: 记住这永恒的时刻，这是我内心充满愉悦的时刻。

source: I looked up at my husband, and I gazed at my daughters, wrapped as we were in the arms of love, and I knew it.
zh_cn: 我深情的望着他，看看我的一双女儿，我们都是被爱包裹好的一家。

source: I was rich. Very rich.
zh_cn: 我很富贵，非常富贵。

source: I quickly turned to thank the woman for her gentle reminder, but she was gone!
zh_cn: 我还想想这位令人尊敬的女士致意，可我一转过身，她就消失在人海之中了。

source: Who was she?
zh_cn: 她是谁？

source: I'll never know.
zh_cn: 我不得而知。

source: But what she did for my outlook, was nothing short of miraculous.
zh_cn: 但她的那种精神，那种瞬间焕发奇迹的精神，却使我永远记得。

source: I will never forget her.
zh_cn: 我将永远铭记她。

source: Where did she disappear to? I can't say.
zh_cn: 话说回来。她又是何时消失的，我又不记得了。

source: Strangely enough, within days, my husband received a job offer in southwestern Virginia.
zh_cn: 很奇怪，才没过几天，刘易斯就被调换工作了，调到了弗吉尼亚州的西南部。

source: In less than two weeks, he was hired and we moved to the place that is now our home.
zh_cn: 不到两个星期，他就租了一间房子，现在已是我们的温馨小屋了。

source: The job notice had been sent out two days before Christmas, even as we hugged and kissed and wished in that bookstore.
zh_cn: 就在那次我们书屋吻别后不久，他就换了工作。

source: Even as I heard the words, "It looks to me, as though you already are," events were already in motion to unite our family.
zh_cn: 我还记得那句话，“我也是的，看到你们幸福，我也不由得幸福起来。”——而这句话，正是我家人重新聚集的力量。

source: I am quite certain that it was all part of God's plan, to remind me of what being "rich" is all about... faith, love, family, and friends.
zh_cn: 我很确信，这是上帝的旨意，意在向我们阐述“富有”的要义，比如说···信念，真爱，家庭，友情等等。

source: And when I get to heaven, I will not be at all surprised to discover that God sent an angel to a second hand bookstore, in Norfolk, Virginia, to give me his richest message, the day after Christmas, many years ago.
zh_cn: 还有假如能遇见上帝，我还会向上帝请求派送一位天使到那间书屋，弗吉尼亚州诺尔佛尔克的那间书屋，几年前的圣诞过后的那天，静静听天使述说幸福的要义。
